* Get Users
#+begin_src verb
get http://127.0.0.1:8080/api/v1/users
#+end_src
* Get Guilds
#+begin_src verb
get http://127.0.0.1:8080/api/v1/guilds
#+end_src

#+RESULTS:
: HTTP/1.1 401 Unauthorized
: Content-Type: application/json; charset=utf-8
: Date: Thu, 12 Mar 2026 09:32:00 GMT
: Content-Length: 25
: 
: {
:   "error": "missing token"
: }
* Create Guild
#+begin_src verb
  post http://127.0.0.1:8080/api/v1/guilds
  Authorization: Bearer 
  
  {
  "id": "774981996878626847"
  }
#+end_src

#+RESULTS:
: HTTP/1.1 403 Forbidden
: Content-Type: application/json; charset=utf-8
: Date: Thu, 12 Mar 2026 10:06:10 GMT
: Content-Length: 29
: 
: {
:   "error": "permission denied"
: }
* Create New Token
#+begin_src verb
  post http://127.0.0.1:8080/api/v1/tokens
  Authorization: Bearer tk_fa7f8dc15c573cf85f88c5ce1d5163eb604c7019fe29e4dba9dfd7297a55f599

  {
  "ttl": 9000
  }
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Content-Type: application/json; charset=utf-8
Date: Thu, 12 Mar 2026 12:30:33 GMT
Content-Length: 173

{
  "expires_at": "2126-03-12T13:30:33.36900883+01:00",
  "id": "85101941-88b1-4658-a182-165f794e8aa6",
  "token": "tk_54fa82f06958fad6721f7f0c0e2e372869cae4bf194bd2995da681720b4f834c"
}
#+end_example
* Get all routes
#+begin_src verb
  get http://127.0.0.1:8080/routes
  Authorization: Bearer tk_123d5462ddb797f8a4d216c2134a08b32510d74d91e5b0ea28803a6dfe53852d
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Content-Type: application/json; charset=utf-8
Date: Thu, 12 Mar 2026 12:50:32 GMT
Content-Length: 1402

[
  {
    "handler": "git.zyner.org/meta/xyter/internal/routes/v1/tokens.GetHandler",
    "method": "GET",
    "path": "/api/v1/tokens"
  },
  {
    "handler": "git.zyner.org/meta/xyter/internal/routes/v1/guilds/id.GetHandler",
    "method": "GET",
    "path": "/api/v1/tokens/:id"
  },
  {
    "handler": "git.zyner.org/meta/xyter/internal/routes/v1/guilds.GetHandler",
    "method": "GET",
    "path": "/api/v1/guilds"
  },
  {
    "handler": "git.zyner.org/meta/xyter/internal/routes/v1/users.GetHandler",
    "method": "GET",
    "path": "/api/v1/users/:id"
  },
  {
    "handler": "git.zyner.org/meta/xyter/internal/routes/v1/guilds/id.GetHandler",
    "method": "GET",
    "path": "/api/v1/:id"
  },
  {
    "handler": "git.zyner.org/meta/xyter/internal/api.Start.ListRoutesHandler.func3",
    "method": "GET",
    "path": "/routes"
  },
  {
    "handler": "git.zyner.org/meta/xyter/internal/routes/v1/guilds.PostHandler",
    "method": "POST",
    "path": "/api/v1/guilds"
  },
  {
    "handler": "git.zyner.org/meta/xyter/internal/routes/v1/users.PostHandler",
    "method": "POST",
    "path": "/api/v1/users"
  },
  {
    "handler": "git.zyner.org/meta/xyter/internal/routes/v1/tokens.PostHandler",
    "method": "POST",
    "path": "/api/v1/tokens"
  },
  {
    "handler": "git.zyner.org/meta/xyter/internal/routes/v1/users.PutHandler",
    "method": "PUT",
    "path": "/api/v1/users/:id"
  },
  {
    "handler": "git.zyner.org/meta/xyter/internal/routes/v1/guilds/id.PutHandler",
    "method": "PUT",
    "path": "/api/v1/tokens/:id"
  },
  {
    "handler": "git.zyner.org/meta/xyter/internal/routes/v1/guilds/id.PutHandler",
    "method": "PUT",
    "path": "/api/v1/:id"
  }
]
#+end_example
